nathanfraske/CEC-Platform/firmware/esp/proto/atx-24pin/sdkconfig.defaults
# CEC 24-pin Module — sdkconfig defaults for ESP32-S3-MINI-1 N4R2
#
# Generate sdkconfig from this with: idf.py set-target esp32s3 && idf.py menuconfig
# (the menuconfig step picks up these defaults; modify them there for tuning)

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash size (ESP32-S3-MINI-1-N4R2 has 4 MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# PSRAM (ESP32-S3-MINI-1-N4R2 has 2 MB QUAD PSRAM -- not the WROOM N16R8's octal 8 MB.
# TYPE_AUTO detects the 2 MB; MODE_QUAD is the in-package R2 PSRAM interface.)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Disable WiFi and BT in the bootloader to save startup time and memory
# (we don't use either)
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n

# USB CDC for high-speed Serial via native USB
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Log level (can be tightened in production)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# CEC sensor selection (shared cec_sensors component). PRODUCTION board: 4x
# INA228 (one per rail, bus voltage + current). The INA226/ACS712/divider front
# end stays enabled until main.c is moved over to the INA228s, then it goes.
CONFIG_CEC_ADC_BACKEND_CONTINUOUS=y
CONFIG_CEC_SENSOR_INA228=y
CONFIG_CEC_SENSOR_INA226=y
CONFIG_CEC_SENSOR_ACS712=y
CONFIG_CEC_SENSOR_THERMISTOR=y

# Dedicated TelePlot UART transport (CH340K USB-C, 921600).
CONFIG_CEC_TELEMETRY_UART0=y
